---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ElementType
source: html/65dc0795-6495-74c0-92b6-267a18ce4d4e.htm
---
# ElementType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.